src/Openfoam/AeroSUV_frontWheels_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          2300;
        startFace       516351;
    }
    outlet
    {
        type            patch;
        nFaces          2300;
        startFace       518651;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1380;
        startFace       520951;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1380;
        startFace       522331;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          7046;
        startFace       523711;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          6000;
        startFace       530757;
    }
    Geometry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4658;
        startFace       536757;
    }
)

// ************************************************************************* //
