src/Openfoam/AeroSUV_frontWheels_case/constant/surfaceFeatureDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object surfaceFeaturesDict;
}

surfaceFeatureExtractDict
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;

    surfaces
    (
        {
            surface 17_wheels-front.stl;
            regions ();
        }
    );
}

