src/Openfoam/AeroSUV_frontWheels_case/system/controlDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application     snappyHexMesh;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          10;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
runTimeModifiable yes;

