src/Openfoam/AeroSUV_frontWheels_case/system/snappyHexMeshDict
FoamFile
{
    version     2;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

castellatedMesh true;

snap            true;

addLayers       true;

mergeTolerance 1e-6;

geometry
{
    Geometry
    {
        type    triSurfaceMesh;
        file    "Geometry/frontWheels/17_wheels-front_scaled.stl";
    }
}


castellatedMeshControls
{
    maxLocalCells      1000000;
    maxGlobalCells     2000000;
    minRefinementCells 10;
    maxLoadUnbalance   0.1;
    mergeTolerance     1e-6;
    nCellsBetweenLevels 3;

    features
    (
    );

    refinementSurfaces
    {
        Geometry
        {
            level (1 3);
        }
    }
    refinementRegions
    {
        // If no volume refinement is needed, keep this empty but present:
    }

    resolveFeatureAngle 30;
    
    allowFreeStandingZoneFaces false;
    
    locationInMesh (0 0 0);


}

snapControls
{
    nSmoothPatch    3;
    tolerance       2;
    nSolveIter      30;
    nRelaxIter      5;
}

addLayersControls
{
    relativeSizes       true;

    layers
    {
        "Geometry.*"
        {
            nSurfaceLayers 3;
        }
    }

    expansionRatio          1.0;
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle      90;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho             65;
    maxBoundarySkewness     20;
    maxInternalSkewness     4;
    maxConcave              80;
    minFlatness             0.5;
    minVol                  1e-13;
    minArea                 -1;
    minTetQuality        1e-30;
    minTwist                0.02;
    minDeterminant          0.001;
    minFaceWeight           0.02;
    minVolRatio             0.01;
    minTriangleTwist        -1;
    nSmoothScale            4;
    errorReduction          0.75;
}

debug               0;

